class Text:
    GRADE = (
        ("Бакалавр", "Бакалавр"),
        ("Магистр", "Магистр"),
        ("Специалист", "Специалист"),
        (
            "Кандидат наук",
            "Кандидат наук",
        ),
        ("Доктор наук", "Доктор наук"),
    )
    RESOURCES = (
        ("GitHub", "GitHub"),
        ("Behance", "Behance"),
        ("Habr", "Habr"),
        ("Персональная страничка", "Персональная страничка"),
        (
            "StackOverflow",
            "StackOverflow",
        ),
    )
    STATUSES = (
        ("Открыт для новых возможностей.", "Открыт для новых возможностей."),
        ("Активный поиск работы.", "Активный поиск работы."),
        (
            "Доступен для интервью и тестирования.",
            "Доступен для интервью и тестирования.",
        ),
    )
    PROFESSIONS = (
        ("Проектный менеджер", "Проектный менеджер"),
        ("Системный аналитик", "Системный аналитик"),
        ("UX/UI дизайнер", "UX/UI дизайнер"),
        ("Frontend разработчик", "Frontend разработчик "),
        ("Backend разработчик", "Backend разработчик "),
        ("Тестировщик", "Тестировщик "),
    )
