class Text:
    GRADE = (
        ("Бакалавр", "Бакалавр"),
        ("Магистр", "Магистр"),
        ("Специалист", "Специалист"),
        (
            "Кандидат наук",
            "Кандидат наук",
        ),
        ("Доктор наук", "Доктор наук"),
    )
    RESOURCES = (
        ("GitHub", "GitHub"),
        ("Behance", "Behance"),
        ("Habr", "Habr"),
        ("Персональная страничка", "Персональная страничка"),
        (
            "StackOverflow",
            "StackOverflow",
        ),
    )
    STATUSES = (
        ("Активно ищу работу", "Активно ищу работу"),
        ("Рассмотрю предложения", "Рассмотрю предложения"),
        ("В творческом поиске", "В творческом поиске"),
    )
    PROFESSIONS = (
        ("Проектный менеджер", "Проектный менеджер"),
        ("Системный аналитик", "Системный аналитик"),
        ("UX/UI дизайнер", "UX/UI дизайнер"),
        ("Frontend разработчик", "Frontend разработчик "),
        ("Backend разработчик", "Backend разработчик "),
        ("Тестировщик", "Тестировщик "),
    )
